# <center> Basics of Pandas </center>

Pandas stands for Panel Data and is the core library for data manipulation 
and data analysis
- We can read and write differnet formats of like JSON,CSV,EXCEL,HTML.etc

In [2]:
# importing pandas library
import pandas as pd

# Python Data Structures 

### Single-dimensional  is called "Series Object"

### Multi-dimensional is called  "DataFrame"

In [7]:
# Series Object is one-dimensional labelled array
s1=pd.Series([1,2,3,4,5,6,7])
s1

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [8]:
# type of series object
type(s1)

pandas.core.series.Series

#### Changing Index

In [9]:
s2=pd.Series([1,2,3,4,5,6,7],index=['a','b','c','d','e','f','g'])
s2

a    1
b    2
c    3
d    4
e    5
f    6
g    7
dtype: int64

#### Series Object from Dictionary

In [12]:
s3=pd.Series({'a':10,'b':20,'c':30,'d':40,'e':50,})
s3

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [13]:
s3=pd.Series({'a':10,'b':20,'c':30,'d':40,'e':50,},index=['b','c','d','e','f','g'])
s3

b    20.0
c    30.0
d    40.0
e    50.0
f     NaN
g     NaN
dtype: float64

#### Extracting Individual Elements

##### Extracting a single element

In [15]:
s3=pd.Series([1,2,3,4,5,6,7,8,9])
s3[4]

5

##### Extracting element from back

In [16]:
s3[-3:]

6    7
7    8
8    9
dtype: int64

##### Extracting a sequence of elements

In [17]:
s3[:4]

0    1
1    2
2    3
3    4
dtype: int64

## Basic Math Operations on Series

#### Adding a scalar value to series elements

In [19]:
# Before 
s3

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [20]:
# After 
s3 +5

0     6
1     7
2     8
3     9
4    10
5    11
6    12
7    13
8    14
dtype: int64

#### Adding tow series objects

In [22]:
p1=pd.Series([1,2,3,4,5])
p2=pd.Series([4,5,6,7,8])
#Addition 
p1+p2

0     5
1     7
2     9
3    11
4    13
dtype: int64

In [23]:
# Subtraction
p1-p2

0   -3
1   -3
2   -3
3   -3
4   -3
dtype: int64

In [25]:
#Multiplication
p1*p2

0     4
1    10
2    18
3    28
4    40
dtype: int64

In [26]:
# Division
p1/p2

0    0.250000
1    0.400000
2    0.500000
3    0.571429
4    0.625000
dtype: float64

## "Dataframe" is a 2-dimensional labelled data structure

In [30]:
pd.DataFrame({"Name":["Ram","Sam","Raghu","Sahil","Ramesh"],"Age":[20,34,22,14,50]})

     Name  Age
0     Ram   20
1     Sam   34
2   Raghu   22
3   Sahil   14
4  Ramesh   50

#### DataFrame In-built Functions

In [31]:
covid_data=pd.read_csv("worldwide covid data.csv")

In [33]:
# Using head() method read first 5 records 
covid_data.head()

,Country,Total Cases,Total Deaths,Total Recovered,Active Cases,Total Cases/1M population,Deaths/1M population,Total Tests,Tests/1M population,Population
0,Afghanistan,155540,7228.0,126459.0,21853.0,3884,180.0,764934.0,19102.0,40044373
1,Albania,175163,2777.0,165434.0,6952.0,60952,966.0,1240204.0,431558.0,2873784
2,Algeria,204695,5855.0,140319.0,58521.0,4563,131.0,230861.0,5146.0,44859760
3,Andorra,15307,130.0,15098.0,79.0,197706,1679.0,193595.0,2500484.0,77423
4,Angola,61580,1629.0,49977.0,9974.0,1802,48.0,1043451.0,30541.0,34165887

In [34]:
# Using tail() method read last 5 records 
covid_data.tail()

,Country,Total Cases,Total Deaths,Total Recovered,Active Cases,Total Cases/1M population,Deaths/1M population,Total Tests,Tests/1M population,Population
201,Venezuela,384668,4634.0,364455.0,15579.0,13577,164.0,3359014.0,118555.0,28333033
202,Vietnam,843281,20670.0,784748.0,37863.0,8565,210.0,42517091.0,431840.0,98455768
203,Yemen,9402,1782.0,5930.0,1690.0,307,58.0,265253.0,8651.0,30662242
204,Zambia,209353,3654.0,205508.0,191.0,10996,192.0,2509600.0,131815.0,19038767
205,Zimbabwe,131875,4643.0,125479.0,1753.0,8711,307.0,1439811.0,95108.0,15138697

In [35]:
# checking the shape of dataset  (display number of rows and columns)
covid_data.shape

(206, 10)

In [36]:
# shows detail  information about the dataset
covid_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206 entries, 0 to 205
Data columns (total 10 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Country                    206 non-null    object
 1   Total Cases                206 non-null    int64
 2   Total Deaths               205 non-null    float64
 3   Total Recovered            204 non-null    float64
 4   Active Cases               204 non-null    float64
 5   Total Cases/1M population  206 non-null    int64
 6   Deaths/1M population       205 non-null    float64
 7   Total Tests                202 non-null    float64
 8   Tests/1M population        202 non-null    float64
 9   Population                 206 non-null    int64
dtypes: float64(6), int64(3), object(1)
memory usage: 16.2+ KB

In [38]:
# shows count ,mean,std,median min, 25% , 50% , 75% , max
covid_data.describe().apply(lambda s:s.apply('{0:.5f}'.format))

,Total Cases,Total Deaths,Total Recovered,Active Cases,Total Cases/1M population,Deaths/1M population,Total Tests,Tests/1M population,Population
count,206.00000,205.00000,204.00000,204.00000,206.00000,205.00000,202.00000,202.00000,206.00000
mean,1160432.58252,23771.81951,1051875.66176,86191.40686,53950.73301,865.55122,18774689.15347,1152444.73267,38120353.13592
std,4364536.68044,80671.35114,3812820.82071,693046.09697,49669.27484,916.53338,69401796.18303,2006809.98219,144765224.48180
min,623.00000,2.00000,55.00000,0.00000,67.00000,3.00000,14689.00000,3293.00000,56.00000
25%,16874.00000,205.00000,12012.25000,668.25000,6578.00000,106.00000,267362.75000,106497.25000,1232545.25000
50%,130322.00000,1992.00000,105774.00000,7027.00000,46260.00000,605.00000,1747174.00000,475244.50000,7492351.00000
75%,556698.50000,11106.00000,534861.50000,28680.00000,87109.25000,1439.00000,9741465.50000,1283685.75000,27342396.00000
max,45313353.00000,734611.00000,34797165.00000,9781577.00000,218292.00000,5951.00000,659963506.00000,14495272.00000,1439323776.00000

#### .iloc[Row:Column]

In [39]:
covid_data.iloc[3:10,1:4]

   Total Cases  Total Deaths  Total Recovered
3        15307         130.0          15098.0
4        61580        1629.0          49977.0
5         3750          93.0           2667.0
6      5266275      115491.0        5133692.0
7       272957        5575.0         249158.0
8        15645         170.0          15324.0
9       131415        1461.0          96234.0

In [40]:
# .loc[] method 
# major differnce is 
# 1.Instead of column index we pass column name 
# 2.In print record from end to end 

#iloc[Row info,(column name....)]
covid_data.loc[1:5,("Total Cases")]

1    175163
2    204695
3     15307
4     61580
5      3750
Name: Total Cases, dtype: int64

In [43]:
# Dropping columns 
l1=covid_data.drop("Total Cases",axis=1)
l1

,Country,Total Deaths,Total Recovered,Active Cases,Total Cases/1M population,Deaths/1M population,Total Tests,Tests/1M population,Population
0,Afghanistan,7228.0,126459.0,21853.0,3884,180.0,764934.0,19102.0,40044373
1,Albania,2777.0,165434.0,6952.0,60952,966.0,1240204.0,431558.0,2873784
2,Algeria,5855.0,140319.0,58521.0,4563,131.0,230861.0,5146.0,44859760
3,Andorra,130.0,15098.0,79.0,197706,1679.0,193595.0,2500484.0,77423
4,Angola,1629.0,49977.0,9974.0,1802,48.0,1043451.0,30541.0,34165887
...,...,...,...,...,...,...,...,...,...
201,Venezuela,4634.0,364455.0,15579.0,13577,164.0,3359014.0,118555.0,28333033
202,Vietnam,20670.0,784748.0,37863.0,8565,210.0,42517091.0,431840.0,98455768
203,Yemen,1782.0,5930.0,1690.0,307,58.0,265253.0,8651.0,30662242
204,Zambia,3654.0,205508.0,191.0,10996,192.0,2509600.0,131815.0,19038767
205,Zimbabwe,4643.0,125479.0,1753.0,8711,307.0,1439811.0,95108.0,15138697

In [44]:
# Dropping Rows
l2=covid_data.drop([3,4],axis=0)
l2

,Country,Total Cases,Total Deaths,Total Recovered,Active Cases,Total Cases/1M population,Deaths/1M population,Total Tests,Tests/1M population,Population
0,Afghanistan,155540,7228.0,126459.0,21853.0,3884,180.0,764934.0,19102.0,40044373
1,Albania,175163,2777.0,165434.0,6952.0,60952,966.0,1240204.0,431558.0,2873784
2,Algeria,204695,5855.0,140319.0,58521.0,4563,131.0,230861.0,5146.0,44859760
5,Antigua and Barbuda,3750,93.0,2667.0,990.0,37893,940.0,17674.0,178592.0,98963
6,Argentina,5266275,115491.0,5133692.0,17092.0,115173,2526.0,24252818.0,530409.0,45724788
...,...,...,...,...,...,...,...,...,...,...
201,Venezuela,384668,4634.0,364455.0,15579.0,13577,164.0,3359014.0,118555.0,28333033
202,Vietnam,843281,20670.0,784748.0,37863.0,8565,210.0,42517091.0,431840.0,98455768
203,Yemen,9402,1782.0,5930.0,1690.0,307,58.0,265253.0,8651.0,30662242
204,Zambia,209353,3654.0,205508.0,191.0,10996,192.0,2509600.0,131815.0,19038767
205,Zimbabwe,131875,4643.0,125479.0,1753.0,8711,307.0,1439811.0,95108.0,15138697

### More Pandas Functions

#### Mean

In [45]:
covid_data.mean()

Total Cases                  1.160433e+06
Total Deaths                 2.377182e+04
Total Recovered              1.051876e+06
Active Cases                 8.619141e+04
Total Cases/1M population    5.395073e+04
Deaths/1M population         8.655512e+02
Total Tests                  1.877469e+07
Tests/1M population          1.152445e+06
Population                   3.812035e+07
dtype: float64

#### Median

In [46]:
covid_data.median()

Total Cases                   130322.0
Total Deaths                    1992.0
Total Recovered               105774.0
Active Cases                    7027.0
Total Cases/1M population      46260.0
Deaths/1M population             605.0
Total Tests                  1747174.0
Tests/1M population           475244.5
Population                   7492351.0
dtype: float64

#### Maximum value

In [48]:
covid_data.max()

Country                         Zimbabwe
Total Cases                     45313353
Total Deaths                    734611.0
Total Recovered               34797165.0
Active Cases                   9781577.0
Total Cases/1M population         218292
Deaths/1M population              5951.0
Total Tests                  659963506.0
Tests/1M population           14495272.0
Population                    1439323776
dtype: object

#### Minimum value

In [49]:
covid_data.min()

Country                      Afghanistan
Total Cases                          623
Total Deaths                         2.0
Total Recovered                     55.0
Active Cases                         0.0
Total Cases/1M population             67
Deaths/1M population                 3.0
Total Tests                      14689.0
Tests/1M population               3293.0
Population                            56
dtype: object

 ### More Pandas Fuctions

In [50]:
def half(s):
    return s*0.5

In [51]:
covid_data[["Total Cases"]].apply(half)

     Total Cases
0        77770.0
1        87581.5
2       102347.5
3         7653.5
4        30790.0
..           ...
201     192334.0
202     421640.5
203       4701.0
204     104676.5
205      65937.5

[206 rows x 1 columns]

In [52]:
covid_data['Country'].value_counts()

Georgia           1
Egypt             1
Mali              1
Senegal           1
Maldives          1
                 ..
Bahamas           1
Botswana          1
Cayman Islands    1
Gabon             1
Cuba              1
Name: Country, Length: 206, dtype: int64

In [53]:
covid_data.sort_values(by="Total Cases")

,Country,Total Cases,Total Deaths,Total Recovered,Active Cases,Total Cases/1M population,Deaths/1M population,Total Tests,Tests/1M population,Population
77,Greenland,623,NaN,573.0,50.0,10950,NaN,79312.0,1393982.0,56
37,Cayman Islands,983,2.0,814.0,167.0,14736,30.0,136206.0,2041885.0,66706
64,Faeroe Islands,1301,2.0,1185.0,114.0,26497,41.0,447000.0,9103870.0,49100
177,St. Barth,1587,6.0,462.0,1119.0,160061,605.0,38369.0,3869793.0,9915
36,Caribbean Netherlands,2257,19.0,2064.0,174.0,85061,716.0,25579.0,964008.0,26534
...,...,...,...,...,...,...,...,...,...,...
155,Russia,7804774,217372.0,6873579.0,713823.0,53452,1489.0,197200000.0,1350552.0,146014362
196,UK,8193769,137763.0,6686695.0,1369311.0,119895,2016.0,314239784.0,4598108.0,68341111
25,Brazil,21582738,601266.0,20694669.0,286803.0,100625,2803.0,63776166.0,297342.0,214487273
89,India,33985920,450991.0,33320057.0,214872.0,24322,323.0,585038043.0,418689.0,1397309368
199,USA,45313353,734611.0,34797165.0,9781577.0,135880,2203.0,659963506.0,1979022.0,333479557

In [3]:
# check version of pandas
pd.__version__

'1.2.4'

In [4]:
data=pd.read_csv("worldwide covid data.csv")

In [6]:
# view the data
# data.head(3) shows first 3 rows of the file
# data.head() by default shows first 5 rows of the file
data.head()

,Country,Total Cases,Total Deaths,Total Recovered,Active Cases,Total Cases/1M population,Deaths/1M population,Total Tests,Tests/1M population,Population
0,Afghanistan,155540,7228.0,126459.0,21853.0,3884,180.0,764934.0,19102.0,40044373
1,Albania,175163,2777.0,165434.0,6952.0,60952,966.0,1240204.0,431558.0,2873784
2,Algeria,204695,5855.0,140319.0,58521.0,4563,131.0,230861.0,5146.0,44859760
3,Andorra,15307,130.0,15098.0,79.0,197706,1679.0,193595.0,2500484.0,77423
4,Angola,61580,1629.0,49977.0,9974.0,1802,48.0,1043451.0,30541.0,34165887

In [9]:
# check column names
data.columns

Index(['Country', 'Total Cases', 'Total Deaths', 'Total Recovered',
       'Active Cases', 'Total Cases/1M population', 'Deaths/1M population',
       'Total Tests', 'Tests/1M population', 'Population'],
      dtype='object')

In [10]:
# check dataypes in columns
data.dtypes

Country                       object
Total Cases                    int64
Total Deaths                 float64
Total Recovered              float64
Active Cases                 float64
Total Cases/1M population      int64
Deaths/1M population         float64
Total Tests                  float64
Tests/1M population          float64
Population                     int64
dtype: object

In [11]:
# check the null values in the data
data.isna().sum()

Country                      0
Total Cases                  0
Total Deaths                 1
Total Recovered              2
Active Cases                 2
Total Cases/1M population    0
Deaths/1M population         1
Total Tests                  4
Tests/1M population          4
Population                   0
dtype: int64